MODEL_CONFIG= {
  "hidden_size": 768,
  "vocab_size" : 8002,
  "max_len" : 64,
  "epochs": 9999,
  "batch_size": 64,
  "dropout": 0.1,
  "learning_rate": 3e-5,
  "warmup_proportion": 0.1,
  "gradient_accumulation_steps": 1,
  "summary_step": 100,
  "adam_epsilon": 1e-8,
  "warmup_steps": 0,
  "max_grad_norm": 1,
  "logging_steps": 100,
  "evaluate_during_training": True,
  "save_steps": 10,
  "max_steps": -1,
  "threshold": 0.3
}

MONGO_URI = ""
DB_NAME = ""
COLLECTION =""
COLLECTION_TEST =""

e_34 = {0:"분노",1:"싫음",2:"짜증남",3:"안타까움",4:"실망",5:"만족",
                6:"중립",7:"놀람",8:"바람", 9:"감동",10:"고마움",11:"기쁨",12:"설렘",
                13:"괴로움",14:"후회",15:"행복",16:"슬픔",17:"두려움",18:"불안",19:"지루함",
                20:"미워함",21:"무관심",22:"즐거움",23:"황홀함",24:"당황",25:"사랑",26:"부러움",
                27:"홀가분함",28:"자신감",29:"미안함",30:"그리움", 31:"억울함",32:"창피함",33:"외로움"}

e_3 = {0:"긍정", 1:"부정",2:"중립"}

e_7 = {0:"중립",1:"싫음",2:"행복",3:"슬픔",4:"두려움",5:"분노",6:"놀람"}

label_info = {"중립": ["중립","바람","무관심", "놀람"],
              "싫음":["싫음","지루함","미워함","짜증남"],
              "행복":["행복","기쁨","감동","즐거움","홀가분함","설렘","만족","자신감","고마움"],
              "슬픔":["슬픔","미안함","안타까움","외로움","실망","괴로움","부러움","후회"],
              "두려움":["두려움","창피함","불안","당황"],
              "분노":["분노","억울함"],
              "사랑":["사랑","그리움","황홀함"]}

emotion7_0 = [6, 8, 21] # 중립
emotion7_1 = [1, 19, 20, 2] #싫음
emotion7_2 = [15, 11, 9, 22, 27, 12, 5, 28, 10] # 행복
emotion7_3 = [16, 29, 3, 33, 4, 13, 26, 14] # 슬픔
emotion7_4 = [17, 32, 18, 24] # 두려움
emotion7_5 = [0, 31] # 분노
emotion7_6 = [25, 30, 23] # 사랑
emotion7_7 = [7] # 놀람

# pos_emotion = [5,8,9,10,11,12,15,22,23,25,26,27,28] # Boneheart Emotion Umbrella 기반 분류
# neg_emotion = [0,1,2,3,4,7,13,14,16,17,18,19,20,21,24,29,30,31,32,33]

pos_emotion = [15, 11, 9, 22, 27, 12, 5, 28, 10, 25, 30, 23]
neg_emotion = [16, 29, 3, 33, 4, 13, 26, 14, 17, 32, 18, 24, 0, 31, 1, 19, 20, 2]

target_names = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33]
